espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG1V/Include/efr32bg1v132f128gj43.h
/** @} End of group EFR32BG1V132F128GJ43_Peripheral_Offsets */

/***************************************************************************//**
 * @defgroup EFR32BG1V132F128GJ43_BitFields Bit Fields
 * @{
 ******************************************************************************/

#include "efr32bg1v_prs_signals.h"
#include "efr32bg1v_dmareq.h"

/***************************************************************************//**
 * @defgroup EFR32BG1V132F128GJ43_UNLOCK Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define RMU_UNLOCK_CODE      0xE084 /**< RMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define RTCC_UNLOCK_CODE     0xAEE8 /**< RTCC unlock code */

/** @} End of group EFR32BG1V132F128GJ43_UNLOCK */

/** @} End of group EFR32BG1V132F128GJ43_BitFields */

#include "efr32bg1v_af_ports.h"
#include "efr32bg1v_af_pins.h"

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFR32BG1V132F128GJ43 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EFR32BG1V132F128GJ43_H */
